import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-feedback-slider',
  templateUrl: './feedback-slider.component.html',
  styleUrls: ['./feedback-slider.component.less'],
})
export class FeedbackSliderComponent implements OnInit {
  public feedbacks = [
    {
      img: '../../../../assets/images/user_photo.png',
      userName: 'Константин Константиновский',
      userChild: 'Дочка, 5 лет',
      title: '«Еще пару недель назад ребенок не мог связывать буквы»',
      text: `Не следует, однако, забывать, 
    что базовый вектор развития напрямую 
    зависит от существующих финансовых и админ условий. 
    Сплочённость команды профессионалов позволяет оценить значение инновационных методов управления процессами. 
    Внезапно, явные признаки победы институционализации призывают нас к новым свершениям, которые, 
    в свою очередь, должны быть заблокированы в рамках своих собственных рациональных ограничений! Не следует, однако, забывать, 
    что базовый вектор развития напрямую 
    зависит от существующих финансовых и админ условий. 
    Сплочённость команды профессионалов позволяет оценить значение инновационных методов управления процессами. 
    Внезапно, явные признаки победы институционализации призывают нас к новым свершениям, которые, 
    в свою очередь, должны быть заблокированы в рамках своих собственных рациональных ограничений!`,
      show: false,
    },
    {
      img: '../../../../assets/images/user_photo.png',
      userName: 'Константин Константиновский',
      userChild: 'Дочка, 5 лет',
      title: '«Еще пару недель назад ребенок не мог связывать буквы»',
      text: `Не следует, однако, забывать, 
    что базовый вектор развития напрямую 
    зависит от существующих финансовых и админ условий. 
    Сплочённость команды профессионалов позволяет оценить значение инновационных методов управления процессами. 
    Внезапно, явные признаки победы институционализации призывают нас к новым свершениям, которые, 
    в свою очередь, должны быть заблокированы в рамках своих собственных рациональных ограничений! Не следует, однако, забывать, 
    что базовый вектор развития напрямую 
    зависит от существующих финансовых и админ условий. 
    Сплочённость команды профессионалов позволяет оценить значение инновационных методов управления процессами. 
    Внезапно, явные признаки победы институционализации призывают нас к новым свершениям, которые, 
    в свою очередь, должны быть заблокированы в рамках своих собственных рациональных ограничений!`,
      show: false,
    },
    {
      img: '../../../../assets/images/user_photo.png',
      userName: 'Константин Константиновский',
      userChild: 'Дочка, 5 лет',
      title: '«Еще пару недель назад ребенок не мог связывать буквы»',
      text: `Не следует, однако, забывать, 
    что базовый вектор развития напрямую 
    зависит от существующих финансовых и админ условий. 
    Сплочённость команды профессионалов позволяет оценить значение инновационных методов управления процессами. 
    Внезапно, явные признаки победы институционализации призывают нас к новым свершениям, которые, 
    в свою очередь, должны быть заблокированы в рамках своих собственных рациональных ограничений! Не следует, однако, забывать, 
    что базовый вектор развития напрямую 
    зависит от существующих финансовых и админ условий. 
    Сплочённость команды профессионалов позволяет оценить значение инновационных методов управления процессами. 
    Внезапно, явные признаки победы институционализации призывают нас к новым свершениям, которые, 
    в свою очередь, должны быть заблокированы в рамках своих собственных рациональных ограничений!`,
      show: false,
    },
  ];
  constructor() {}

  ngOnInit(): void {}
}
